OpenFOAM/WFD_OpenFOAM/cases/batch_001/baseline_pitch_8p5_chord_0p4_0p6_0p25/system/cutPlane
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

type            surfaces;
libs            ("libsampling.so");

writeControl    writeTime;

surfaceFormat   vtk;

writeFormat     binary;

fields          (p U);

interpolationScheme cellPoint;

surfaces
{
    yNormal
    {
        type            cutPlane;
        planeType       pointAndNormal;
        point           (0 0 0);
        normal          (0 1 0);
        interpolate     true;
    }
}


// ************************************************************************* //
