OpenFOAM/WFD_OpenFOAM/cases/batch_001/baseline_pitch_8p5_chord_0p4_0p6_0p25/system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaces ("../triSurface/baseline_pitch_8p5_chord_0p4_0p6_0p25.stl");

// Identify a feature when angle between faces < includedAngle
includedAngle   150;

trimFeatures
{
    minElem         5;
}

// ************************************************************************* //
